Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/**
  ******************************************************************************
  * @file    py32e407_ll_dma.h
  * @author  MCU Application Team
  * @brief   Header file of DMA LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32E407_LL_DMA_H
#define __PY32E407_LL_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx.h"

/** @addtogroup PY32E407_LL_Driver
  * @{
  */
#if defined (DMA1) || defined (DMA2)

/** @defgroup DMA_LL DMA
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup DMA_LL_Private_Variables DMA Private Variables
  * @{
  */
/* Array used to get the DMA channel register offset versus channel index LL_DMA_CHANNEL_x */
static const uint32_t CHANNEL_OFFSET_TAB[] =
{
  (uint32_t)(DMA1_Channel1_BASE - DMA1_BASE),
  (uint32_t)(DMA1_Channel2_BASE - DMA1_BASE),
  (uint32_t)(DMA1_Channel3_BASE - DMA1_BASE),
  (uint32_t)(DMA1_Channel4_BASE - DMA1_BASE),
  (uint32_t)(DMA1_Channel5_BASE - DMA1_BASE),
  (uint32_t)(DMA1_Channel6_BASE - DMA1_BASE)
};
/**
  * @}
  */
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup DMA_LL_ES_INIT DMA Exported Init structure
  * @{
  */
typedef struct
{
  uint32_t SrcAddress;                /*!< Specifies the source address for DMA transfer.
                                        This parameter must be a value between Min_Data = 0 and Max_Data = 0xFFFFFFFF. */

  uint32_t DstAddress;                /*!< Specifies the destination address for DMA transfer.
                                        This parameter must be a value between Min_Data = 0 and Max_Data = 0xFFFFFFFF. */
  
  uint32_t Direction;                 /*!< Specifies transfer direction.
                                           This parameter can be a value of @ref DMA_LL_EC_Data_transfer_direction */

  uint32_t SrcIncMode;                /*!< Specifies source address increment.
                                           This parameter can be a value of @ref DMA_LL_EC_Source_Address_Increment */
  
  uint32_t DstIncMode;                /*!< Specifies destination address increment.
                                           This parameter can be a value of @ref DMA_LL_EC_Destination_Address_Increment */
  
  uint32_t SrcWidth;                  /*!< Specifies source transfer width.
                                           This parameter can be a value of @ref DMA_LL_EC_Source_Transfer_Width */
  
  uint32_t DstWidth;                  /*!< Specifies destination transfer width.
                                           This parameter can be a value of @ref DMA_LL_EC_Destination_Transfer_Width */
  
  uint32_t SrcBurstLen;               /*!< Specifies source burst transaction length.
                                           This parameter can be a value of @ref DMA_LL_EC_Source_Burst_Transaction_Length */
  
  uint32_t DstBurstLen;               /*!< Specifies destination burst transaction length.
                                           This parameter can be a value of @ref DMA_LL_EC_Destination_Burst_Transaction_Length  */

  uint32_t SrcHandshakeType;          /*!< Specifies source handshake type.
                                           This parameter can be a value of @ref DMA_LL_EC_Source_Handshake_Type */
  
  uint32_t DstHandshakeType;          /*!< Specifies destination handshake type.
                                           This parameter can be a value of @ref DMA_LL_EC_Destination_Handshake_Type */
    
  uint32_t Priority;                  /*!< Specifies channel priority.
                                           This parameter can be a value of @ref DMA_LL_EC_Priority_level */

} LL_DMA_InitTypeDef;
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup DMA_LL_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_LL_EC_CHANNEL CHANNEL
  * @{
  */
#define LL_DMA_CHANNEL_1                  0x00000001U /*!< DMA Channel 1 */
#define LL_DMA_CHANNEL_2                  0x00000002U /*!< DMA Channel 2 */
#define LL_DMA_CHANNEL_3                  0x00000003U /*!< DMA Channel 3 */
#define LL_DMA_CHANNEL_4                  0x00000004U /*!< DMA Channel 4 */
#define LL_DMA_CHANNEL_5                  0x00000005U /*!< DMA Channel 5 */
#define LL_DMA_CHANNEL_6                  0x00000006U /*!< DMA Channel 6 */
#if defined(USE_FULL_LL_DRIVER)
#define LL_DMA_CHANNEL_ALL                0xFFFF0000U /*!< DMA Channel all (used only for function @ref LL_DMA_DeInit(). */
#endif /*USE_FULL_LL_DRIVER*/
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_DMA_PERIPH DMA PERIPH
  * @{
  */
#define LL_SYSCFG_DMA_PERIPH_MAP_1       0x00000001U
#define LL_SYSCFG_DMA_PERIPH_MAP_2       0x00000002U
#define LL_SYSCFG_DMA_PERIPH_MAP_3       0x00000003U
#define LL_SYSCFG_DMA_PERIPH_MAP_4       0x00000004U
#define LL_SYSCFG_DMA_PERIPH_MAP_5       0x00000005U
#define LL_SYSCFG_DMA_PERIPH_MAP_6       0x00000006U
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DMA_MAP DMA MAP
  * @{
  */
#define LL_SYSCFG_DMA_MAP_ADC1           0x00000000U
#define LL_SYSCFG_DMA_MAP_ADC2           0x00000001U
#define LL_SYSCFG_DMA_MAP_ADC3           0x00000002U
#define LL_SYSCFG_DMA_MAP_DAC1           0x00000003U
#define LL_SYSCFG_DMA_MAP_DAC2           0x00000004U
#define LL_SYSCFG_DMA_MAP_SPI1_RX        0x00000005U
#define LL_SYSCFG_DMA_MAP_SPI1_TX        0x00000006U
#define LL_SYSCFG_DMA_MAP_SPI2_RX        0x00000007U
#define LL_SYSCFG_DMA_MAP_SPI2_TX        0x00000008U
#define LL_SYSCFG_DMA_MAP_SPI3_RX        0x00000009U
#define LL_SYSCFG_DMA_MAP_SPI3_TX        0x0000000AU
#define LL_SYSCFG_DMA_MAP_USART1_RX      0x0000000BU
#define LL_SYSCFG_DMA_MAP_USART1_TX      0x0000000CU
#define LL_SYSCFG_DMA_MAP_USART2_RX      0x0000000DU
#define LL_SYSCFG_DMA_MAP_USART2_TX      0x0000000EU
#define LL_SYSCFG_DMA_MAP_USART3_RX      0x0000000FU
#define LL_SYSCFG_DMA_MAP_USART3_TX      0x00000010U
#define LL_SYSCFG_DMA_MAP_LPUART1_RX     0x00000011U
#define LL_SYSCFG_DMA_MAP_LPUART1_TX     0x00000012U
#define LL_SYSCFG_DMA_MAP_I2C1_RX        0x00000013U
#define LL_SYSCFG_DMA_MAP_I2C1_TX        0x00000014U
#define LL_SYSCFG_DMA_MAP_I2C2_RX        0x00000015U
#define LL_SYSCFG_DMA_MAP_I2C2_TX        0x00000016U
#define LL_SYSCFG_DMA_MAP_I2C3_RX        0x00000017U
#define LL_SYSCFG_DMA_MAP_I2C3_TX        0x00000018U
#define LL_SYSCFG_DMA_MAP_I2C4_RX        0x00000019U
#define LL_SYSCFG_DMA_MAP_I2C4_TX        0x0000001AU
#define LL_SYSCFG_DMA_MAP_TIM1_CH1       0x0000001BU
#define LL_SYSCFG_DMA_MAP_TIM1_CH2       0x0000001CU
#define LL_SYSCFG_DMA_MAP_TIM1_CH3       0x0000001DU
#define LL_SYSCFG_DMA_MAP_TIM1_CH4       0x0000001EU
#define LL_SYSCFG_DMA_MAP_TIM1_UP        0x0000001FU
#define LL_SYSCFG_DMA_MAP_TIM1_TRIG      0x00000020U
#define LL_SYSCFG_DMA_MAP_TIM1_COM       0x00000021U
#define LL_SYSCFG_DMA_MAP_TIM8_CH1       0x00000022U
#define LL_SYSCFG_DMA_MAP_TIM8_CH2       0x00000023U
#define LL_SYSCFG_DMA_MAP_TIM8_CH3       0x00000024U
#define LL_SYSCFG_DMA_MAP_TIM8_CH4       0x00000025U
#define LL_SYSCFG_DMA_MAP_TIM8_UP        0x00000026U
#define LL_SYSCFG_DMA_MAP_TIM8_TRIG      0x00000027U
#define LL_SYSCFG_DMA_MAP_TIM8_COM       0x00000028U
#define LL_SYSCFG_DMA_MAP_TIM6_UP        0x00000029U
#define LL_SYSCFG_DMA_MAP_TIM7_UP        0x0000002AU
#define LL_SYSCFG_DMA_MAP_TIM2_CH1       0x0000002BU
#define LL_SYSCFG_DMA_MAP_TIM2_CH2       0x0000002CU
#define LL_SYSCFG_DMA_MAP_TIM2_CH3       0x0000002DU
#define LL_SYSCFG_DMA_MAP_TIM2_CH4       0x0000002EU
#define LL_SYSCFG_DMA_MAP_TIM2_UP        0x0000002FU
#define LL_SYSCFG_DMA_MAP_TIM2_TRIG      0x00000030U
#define LL_SYSCFG_DMA_MAP_TIM3_CH1       0x00000031U
#define LL_SYSCFG_DMA_MAP_TIM3_CH2       0x00000032U
#define LL_SYSCFG_DMA_MAP_TIM3_CH3       0x00000033U
#define LL_SYSCFG_DMA_MAP_TIM3_CH4       0x00000034U
#define LL_SYSCFG_DMA_MAP_TIM3_UP        0x00000035U
#define LL_SYSCFG_DMA_MAP_TIM3_TRIG      0x00000036U
#define LL_SYSCFG_DMA_MAP_TIM4_CH1       0x00000037U
#define LL_SYSCFG_DMA_MAP_TIM4_CH2       0x00000038U
#define LL_SYSCFG_DMA_MAP_TIM4_CH3       0x00000039U
#define LL_SYSCFG_DMA_MAP_TIM4_CH4       0x0000003AU
#define LL_SYSCFG_DMA_MAP_TIM4_UP        0x0000003BU
#define LL_SYSCFG_DMA_MAP_TIM4_TRIG      0x0000003CU
#define LL_SYSCFG_DMA_MAP_TIM5_CH1       0x0000003DU
#define LL_SYSCFG_DMA_MAP_TIM5_CH2       0x0000003EU
#define LL_SYSCFG_DMA_MAP_TIM5_CH3       0x0000003FU
#define LL_SYSCFG_DMA_MAP_TIM5_CH4       0x00000040U
#define LL_SYSCFG_DMA_MAP_TIM5_UP        0x00000041U
#define LL_SYSCFG_DMA_MAP_TIM5_TRIG      0x00000042U
#define LL_SYSCFG_DMA_MAP_TIM18_CH1      0x00000043U
#define LL_SYSCFG_DMA_MAP_TIM18_CH2      0x00000044U
#define LL_SYSCFG_DMA_MAP_TIM18_CH3      0x00000045U
#define LL_SYSCFG_DMA_MAP_TIM18_CH4      0x00000046U
#define LL_SYSCFG_DMA_MAP_TIM18_UP       0x00000047U
#define LL_SYSCFG_DMA_MAP_TIM18_TRIG     0x00000048U
#define LL_SYSCFG_DMA_MAP_TIM15_CH1      0x00000049U
#define LL_SYSCFG_DMA_MAP_TIM15_UP       0x0000004BU
#define LL_SYSCFG_DMA_MAP_TIM15_TRIG     0x0000004CU
#define LL_SYSCFG_DMA_MAP_TIM15_COM      0x0000004DU
#define LL_SYSCFG_DMA_MAP_TIM16_CH1      0x0000004EU
#define LL_SYSCFG_DMA_MAP_TIM16_UP       0x0000004FU
#define LL_SYSCFG_DMA_MAP_TIM17_CH1      0x00000050U
#define LL_SYSCFG_DMA_MAP_TIM17_UP       0x00000051U
#define LL_SYSCFG_DMA_MAP_AES_IN         0x00000052U
#define LL_SYSCFG_DMA_MAP_AES_OUT        0x00000053U
#define LL_SYSCFG_DMA_MAP_Cordic_Read    0x00000054U
#define LL_SYSCFG_DMA_MAP_Cordic_Write   0x00000055U
#define LL_SYSCFG_DMA_MAP_ESMC_RX        0x00000056U
#define LL_SYSCFG_DMA_MAP_ESMC_TX        0x00000057U
#define LL_SYSCFG_DMA_MAP_SDIO           0x00000058U
#define LL_SYSCFG_DMA_MAP_UART1_RX       0x00000059U
#define LL_SYSCFG_DMA_MAP_UART1_TX       0x0000005AU
#define LL_SYSCFG_DMA_MAP_UART2_RX       0x0000005BU
#define LL_SYSCFG_DMA_MAP_UART2_TX       0x0000005CU
#define LL_SYSCFG_DMA_MAP_UART3_RX       0x0000005DU
#define LL_SYSCFG_DMA_MAP_UART3_TX       0x0000005EU
#define LL_SYSCFG_DMA_MAP_LCDC_TX        0x0000005FU

/**
  * @}
  */

/** @defgroup DMA_mode DMA mode
  * @{
  */
#define LL_DMA_MODE_NORMAL         0x00000000U                  /*!< Normal mode   */
#define LL_DMA_MODE_CIRCULAR       0x00000001U                  /*!< Circular mode */
/**
  * @}
  */



/** @defgroup DMA_LL_EC_Data_transfer_direction DMA Data transfer direction
  * @{
  */
#define LL_DMA_DIRECTION_MEMORY_TO_MEMORY         0x00000000U                       /*!< Memory to memory direction     */
#define LL_DMA_DIRECTION_MEMORY_TO_PERIPH         ((uint32_t)DMA_CH_CTRLL_TT_0)     /*!< Memory to peripheral direction */
#define LL_DMA_DIRECTION_PERIPH_TO_MEMORY         ((uint32_t)DMA_CH_CTRLL_TT_1)     /*!< Peripheral to memory direction */
#define LL_DMA_DIRECTION_PERIPH_TO_PERIPH         ((uint32_t)DMA_CH_CTRLL_TT)       /*!< Peripheral to Peripheral direction */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Source_Transfer_Width DMA Source Transfer Width
  * @{
  */
#define LL_DMA_SRC_WIDTH_BYTE         0x00000000U                                 /*!< Source transfer width is 8 bits     */
#define LL_DMA_SRC_WIDTH_HALFWORD     ((uint32_t)DMA_CH_CTRLL_SRC_TR_WIDTH_0)     /*!< Source transfer width is 16 bits     */
#define LL_DMA_SRC_WIDTH_WORD         ((uint32_t)DMA_CH_CTRLL_SRC_TR_WIDTH_1)     /*!< Source transfer width is 32 bits     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Destination_Transfer_Width DMA Destination Transfer Width
  * @{
  */
#define LL_DMA_DST_WIDTH_BYTE         0x00000000U                                 /*!< Destination transfer width is 8 bits     */
#define LL_DMA_DST_WIDTH_HALFWORD     ((uint32_t)DMA_CH_CTRLL_DST_TR_WIDTH_0)     /*!< Destination transfer width is 16 bits     */
#define LL_DMA_DST_WIDTH_WORD         ((uint32_t)DMA_CH_CTRLL_DST_TR_WIDTH_1)     /*!< Destination transfer width is 32 bits     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Source_Burst_Transaction_Length DMA Source Burst Transaction Length
  * @{
  */
#define LL_DMA_SRC_BURST_LEN_1         0x00000000U                                                           /*!< Number of data items to be transferred is 1     */
#define LL_DMA_SRC_BURST_LEN_4         ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_0)                                  /*!< Number of data items to be transferred is 4     */
#define LL_DMA_SRC_BURST_LEN_8         ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_1)                                  /*!< Number of data items to be transferred is 8     */
#define LL_DMA_SRC_BURST_LEN_16        ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_1 | DMA_CH_CTRLL_SRC_MSIZE_0))     /*!< Number of data items to be transferred is 16     */
#define LL_DMA_SRC_BURST_LEN_32        ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_2)                                  /*!< Number of data items to be transferred is 32     */
#define LL_DMA_SRC_BURST_LEN_64        ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_2 | DMA_CH_CTRLL_SRC_MSIZE_0))     /*!< Number of data items to be transferred is 64     */
#define LL_DMA_SRC_BURST_LEN_128       ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_2 | DMA_CH_CTRLL_SRC_MSIZE_1))     /*!< Number of data items to be transferred is 128     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Destination_Burst_Transaction_Length DMA Destination Burst Transaction Length
  * @{
  */
#define LL_DMA_DST_BURST_LEN_1         0x00000000U                                                           /*!< Number of data items to be transferred is 1     */
#define LL_DMA_DST_BURST_LEN_4         ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_0)                                  /*!< Number of data items to be transferred is 4     */
#define LL_DMA_DST_BURST_LEN_8         ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_1)                                  /*!< Number of data items to be transferred is 8     */
#define LL_DMA_DST_BURST_LEN_16        ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_1 | DMA_CH_CTRLL_DST_MSIZE_0))     /*!< Number of data items to be transferred is 16     */
#define LL_DMA_DST_BURST_LEN_32        ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_2)                                  /*!< Number of data items to be transferred is 32     */
#define LL_DMA_DST_BURST_LEN_64        ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_2 | DMA_CH_CTRLL_DST_MSIZE_0))     /*!< Number of data items to be transferred is 64     */
#define LL_DMA_DST_BURST_LEN_128       ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_2 | DMA_CH_CTRLL_DST_MSIZE_1))     /*!< Number of data items to be transferred is 128     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Source_Address_Increment Source Address Increment
  * @{
  */
#define LL_DMA_SRC_ADDR_INC            0x00000000U                       /*!< Increments the source address     */
#define LL_DMA_SRC_ADDR_DEC            ((uint32_t)DMA_CH_CTRLL_SINC_0)   /*!< Decrements the source address     */
#define LL_DMA_SRC_ADDR_FIX            ((uint32_t)DMA_CH_CTRLL_SINC_1)   /*!< No change in the source address     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Destination_Address_Increment Destination Address Increment
  * @{
  */
#define LL_DMA_DST_ADDR_INC            0x00000000U                       /*!< Increments the destination address     */
#define LL_DMA_DST_ADDR_DEC            ((uint32_t)DMA_CH_CTRLL_DINC_0)   /*!< Decrements the destination address     */
#define LL_DMA_DST_ADDR_FIX            ((uint32_t)DMA_CH_CTRLL_DINC_1)   /*!< No change in the destination address     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Source_Handshake_Type Source Handshake Type
  * @{
  */
#define LL_DMA_SRC_HANDSHAKE_TYPE_HARD         0x00000000U                         /*!< Select hardware handshake for source    */
#define LL_DMA_SRC_HANDSHAKE_TYPE_SOFT         ((uint32_t)DMA_CH_CFGL_HS_SEL_SRC)  /*!< Select software handshake for source    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Destination_Handshake_Type Destination Handshake Type
  * @{
  */
#define LL_DMA_DST_HANDSHAKE_TYPE_HARD         0x00000000U                         /*!< Select hardware handshake for destination    */
#define LL_DMA_DST_HANDSHAKE_TYPE_SOFT         ((uint32_t)DMA_CH_CFGL_HS_SEL_DST)  /*!< Select software handshake for destination    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_Priority_level DMA Priority level
  * @{
  */
#define LL_DMA_PRIORITY_0             0x00000000U
#define LL_DMA_PRIORITY_1             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_0)
#define LL_DMA_PRIORITY_2             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_1)
#define LL_DMA_PRIORITY_3             ((uint32_t)(DMA_CH_CFGL_CH_PRIOR_1 | DMA_CH_CFGL_CH_PRIOR_0))
#define LL_DMA_PRIORITY_4             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_2)
#define LL_DMA_PRIORITY_5             ((uint32_t)(DMA_CH_CFGL_CH_PRIOR_2 | DMA_CH_CFGL_CH_PRIOR_0))
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DST_PERIPH Destination Periph
  * @{
  */
#define LL_DMA_DST_PERIPH_MAP_1          0x00000000U                                                    /*!< Destination hardware interface to requst 0    */
#define LL_DMA_DST_PERIPH_MAP_2         ((uint32_t)DMA_CH_CFGH_DST_PER_0)                               /*!< Destination hardware interface to requst 1    */
#define LL_DMA_DST_PERIPH_MAP_3         ((uint32_t)DMA_CH_CFGH_DST_PER_1)                               /*!< Destination hardware interface to requst 2    */
#define LL_DMA_DST_PERIPH_MAP_4         ((uint32_t)(DMA_CH_CFGH_DST_PER_1 | DMA_CH_CFGH_DST_PER_0))     /*!< Destination hardware interface to requst 3    */
#define LL_DMA_DST_PERIPH_MAP_5         ((uint32_t)DMA_CH_CFGH_DST_PER_2)                               /*!< Destination hardware interface to requst 4    */
#define LL_DMA_DST_PERIPH_MAP_6         ((uint32_t)(DMA_CH_CFGH_DST_PER_2 | DMA_CH_CFGH_DST_PER_0))     /*!< Destination hardware interface to requst 5    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SRC_PERIPH Source Periph
  * @{
  */
#define LL_DMA_SRC_PERIPH_MAP_1          0x00000000U                                                    /*!< Source hardware interface to requst 0   */
#define LL_DMA_SRC_PERIPH_MAP_2         ((uint32_t)DMA_CH_CFGH_SRC_PER_0)                               /*!< Source hardware interface to requst 1   */
#define LL_DMA_SRC_PERIPH_MAP_3         ((uint32_t)DMA_CH_CFGH_SRC_PER_1)                               /*!< Source hardware interface to requst 2    */
#define LL_DMA_SRC_PERIPH_MAP_4         ((uint32_t)(DMA_CH_CFGH_SRC_PER_1 | DMA_CH_CFGH_SRC_PER_0))     /*!< Source hardware interface to requst 3   */
#define LL_DMA_SRC_PERIPH_MAP_5         ((uint32_t)DMA_CH_CFGH_SRC_PER_2)                               /*!< Source hardware interface to requst 4   */
#define LL_DMA_SRC_PERIPH_MAP_6         ((uint32_t)(DMA_CH_CFGH_SRC_PER_2 | DMA_CH_CFGH_SRC_PER_0))     /*!< Source hardware interface to requst 5   */
/**
  * @}
  */



