Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/** @defgroup DMA_LL_EC_FIFO_Mode DMA FIFO mode
  * @{
  */
#define LL_DMA_FIFO_MODE_0             0x00000000U                        /*!< Space/data available for single
                                                                            AHB transfer of the specified transfer width    */
#define LL_DMA_FIFO_MODE_1             ((uint32_t)DMA_CH_CFGH_FIFO_MODE)  /*!< Data available is greater than or
                                                                            equal to half the FIFO depth for destination transfers and
                                                                            space available is greater than half the fifo depth for
                                                                            source transfers.     */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DMA_LL_Exported_Macros DMA Exported Macros
  * @{
  */

/** @defgroup DMA_LL_EM_WRITE_READ Common Write and read registers macros
  * @{
  */
/**
  * @brief  Write a value in DMA register
  * @param  __INSTANCE__ DMA Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_DMA_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in DMA register
  * @param  __INSTANCE__ DMA Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_DMA_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup DMA_LL_EM_CONVERT_DMAxCHANNELy Convert DMAxChannely
  * @{
  */

/**
  * @brief  Convert DMAx_Channely into DMAx
  * @param  __CHANNEL_INSTANCE__ DMAx_Channely
  * @retval DMAx
  */
#if defined(DMA2)
#define __LL_DMA_GET_INSTANCE(__CHANNEL_INSTANCE__)   \
(((uint32_t)(__CHANNEL_INSTANCE__) > ((uint32_t)DMA1_Channel6)) ?  DMA2 : DMA1)
#else
#define __LL_DMA_GET_INSTANCE(__CHANNEL_INSTANCE__)  (DMA1)
#endif

/**
  * @brief  Convert DMAx_Channely into LL_DMA_CHANNEL_y
  * @param  __CHANNEL_INSTANCE__ DMAx_Channely
  * @retval LL_DMA_CHANNEL_y
  */
#if defined (DMA2)
#define __LL_DMA_GET_CHANNEL(__CHANNEL_INSTANCE__)   \
(((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel1)) ? LL_DMA_CHANNEL_1 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA2_Channel1)) ? LL_DMA_CHANNEL_1 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel2)) ? LL_DMA_CHANNEL_2 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA2_Channel2)) ? LL_DMA_CHANNEL_2 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel3)) ? LL_DMA_CHANNEL_3 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA2_Channel3)) ? LL_DMA_CHANNEL_3 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel4)) ? LL_DMA_CHANNEL_4 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA2_Channel4)) ? LL_DMA_CHANNEL_4 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel5)) ? LL_DMA_CHANNEL_5 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA2_Channel5)) ? LL_DMA_CHANNEL_5 : \
 LL_DMA_CHANNEL_6)
#else
#define __LL_DMA_GET_CHANNEL(__CHANNEL_INSTANCE__)   \
(((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel1)) ? LL_DMA_CHANNEL_1 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel2)) ? LL_DMA_CHANNEL_2 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel3)) ? LL_DMA_CHANNEL_3 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel4)) ? LL_DMA_CHANNEL_4 : \
 ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)DMA1_Channel5)) ? LL_DMA_CHANNEL_5 : \
 LL_DMA_CHANNEL_6)
#endif

/**
  * @brief  Convert DMA Instance DMAx and LL_DMA_CHANNEL_y into DMAx_Channely
  * @param  __DMA_INSTANCE__ DMAx
  * @param  __CHANNEL__ LL_DMA_CHANNEL_y
  * @retval DMAx_Channely
  */
#if defined (DMA2)
#define __LL_DMA_GET_CHANNEL_INSTANCE(__DMA_INSTANCE__, __CHANNEL__)   \
((((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_1))) ? DMA1_Channel1 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA2)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_1))) ? DMA2_Channel1 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_2))) ? DMA1_Channel2 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA2)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_2))) ? DMA2_Channel2 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_3))) ? DMA1_Channel3 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA2)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_3))) ? DMA2_Channel3 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_4))) ? DMA1_Channel4 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA2)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_4))) ? DMA2_Channel4 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_5))) ? DMA1_Channel5 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA2)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_5))) ? DMA2_Channel5 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_6))) ? DMA1_Channel6 : \
 DMA2_Channel6)
#else
#define __LL_DMA_GET_CHANNEL_INSTANCE(__DMA_INSTANCE__, __CHANNEL__)   \
((((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_1))) ? DMA1_Channel1 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_2))) ? DMA1_Channel2 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_3))) ? DMA1_Channel3 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_4))) ? DMA1_Channel4 : \
 (((uint32_t)(__DMA_INSTANCE__) == ((uint32_t)DMA1)) && ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_DMA_CHANNEL_5))) ? DMA1_Channel5 : \
 DMA1_Channel6)
#endif

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup DMA_LL_Exported_Functions DMA Exported Functions
 * @{
 */

/** @defgroup DMA_LL_EF_Configuration Configuration
  * @{
  */
/**
  * @brief  Enable DMA.
  * @rmtoll EN          DMA_EN            LL_DMA_Enable
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_Enable(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->EN, DMA_EN_DMA_EN);
}

/**
  * @brief  Disable DMA.
  * @rmtoll EN          DMA_EN            LL_DMA_Disable
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_Disable(DMA_TypeDef *DMAx)
{
  CLEAR_BIT(DMAx->EN, DMA_EN_DMA_EN);
}

/**
  * @brief  Check if DMA is enabled or disabled.
  * @rmtoll EN          DMA_EN            LL_DMA_IsEnabled
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabled(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->EN, DMA_EN_DMA_EN) == (DMA_EN_DMA_EN));
}

/**
  * @brief  Enable DMA channel.
  * @rmtoll CH_EN         CH_EN            LL_DMA_EnableChannel
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableChannel(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->CH_EN, ((DMA_CH_EN_CH_EN_WE_0 | DMA_CH_EN_CH_EN_0) << (Channel - 1U)));
}

/**
  * @brief  Disable DMA channel.
  * @rmtoll CH_EN          CH_EN            LL_DMA_DisableChannel
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableChannel(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << (Channel - 1U)), \
                                                           (DMA_CH_EN_CH_EN_WE_0 << (Channel - 1U)));
}

/**
  * @brief  Check if DMA channel is enabled or disabled.
  * @rmtoll CH_EN          CH_EN            LL_DMA_IsEnabledChannel
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledChannel(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->CH_EN, (DMA_CH_EN_CH_EN_0 << (Channel - 1U))) == (DMA_CH_EN_CH_EN_0 << (Channel - 1U)));
}

/**
  * @brief  Configure all parameters link to DMA transfer.
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_MEMORY or @ref LL_DMA_DIRECTION_MEMORY_TO_PERIPH or @ref LL_DMA_DIRECTION_MEMORY_TO_MEMORY
  *         @arg @ref LL_DMA_DST_ADDR_INC or @ref LL_DMA_DST_ADDR_DEC or @ref LL_DMA_DST_ADDR_FIX
  *         @arg @ref LL_DMA_SRC_ADDR_INC or @ref LL_DMA_SRC_ADDR_DEC or @ref LL_DMA_SRC_ADDR_FIX
  *         @arg @ref LL_DMA_DST_WIDTH_BYTE or @ref LL_DMA_DST_WIDTH_HALFWORD or @ref LL_DMA_DST_WIDTH_WORD
  *         @arg @ref LL_DMA_SRC_WIDTH_BYTE or @ref LL_DMA_SRC_WIDTH_HALFWORD or @ref LL_DMA_SRC_WIDTH_WORD
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ConfigTransfer(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Configuration)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_TT | DMA_CH_CTRLL_SINC | DMA_CH_CTRLL_DINC | DMA_CH_CTRLL_SRC_TR_WIDTH | DMA_CH_CTRLL_DST_TR_WIDTH ,
             Configuration);
}

/**
  * @brief  Set Data transfer direction.
  * @rmtoll CH_CTRLL         TT            LL_DMA_SetDataTransferDirection
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Direction This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DIRECTION_MEMORY_TO_MEMORY
  *         @arg @ref LL_DMA_DIRECTION_MEMORY_TO_PERIPH
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_MEMORY
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_PERIPH
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDataTransferDirection(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Direction)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_TT, Direction);
}

/**
  * @brief  Get Data transfer direction.
  * @rmtoll CH_CTRLL         TT            LL_DMA_GetDataTransferDirection
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DIRECTION_MEMORY_TO_MEMORY
  *         @arg @ref LL_DMA_DIRECTION_MEMORY_TO_PERIPH
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_MEMORY
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_PERIPH
  */
__STATIC_INLINE uint32_t LL_DMA_GetDataTransferDirection(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_TT));
}

/**
  * @brief  Set source burst transaction length.
  * @rmtoll CH_CTRLL         SRC_MSIZE            LL_DMA_SetSrcBurstLen
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Length This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_BURST_LEN_1  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_4  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_8  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_16 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_32 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_64 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_128
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcBurstLen(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Length)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_SRC_MSIZE, Length);
}

/**
  * @brief  Get source burst transaction length.
  * @rmtoll CH_CTRLL         SRC_MSIZE            LL_DMA_GetSrcBurstLen
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_BURST_LEN_1  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_4  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_8  
  *         @arg @ref LL_DMA_SRC_BURST_LEN_16 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_32 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_64 
  *         @arg @ref LL_DMA_SRC_BURST_LEN_128
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcBurstLen(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_SRC_MSIZE));
}

/**
  * @brief  Set destination burst transaction length.
  * @rmtoll CH_CTRLL         DST_MSIZE            LL_DMA_SetDstBurstLen
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Length This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DST_BURST_LEN_1  
  *         @arg @ref LL_DMA_DST_BURST_LEN_4  
  *         @arg @ref LL_DMA_DST_BURST_LEN_8  
  *         @arg @ref LL_DMA_DST_BURST_LEN_16 
  *         @arg @ref LL_DMA_DST_BURST_LEN_32 
  *         @arg @ref LL_DMA_DST_BURST_LEN_64 
  *         @arg @ref LL_DMA_DST_BURST_LEN_128
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstBurstLen(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Length)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_DST_MSIZE, Length);
}

/**
  * @brief  Get destination burst transaction length.
  * @rmtoll CH_CTRLL         DST_MSIZE            LL_DMA_GetDstcBurstLen
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DST_BURST_LEN_1  
  *         @arg @ref LL_DMA_DST_BURST_LEN_4  
  *         @arg @ref LL_DMA_DST_BURST_LEN_8  
  *         @arg @ref LL_DMA_DST_BURST_LEN_16 
  *         @arg @ref LL_DMA_DST_BURST_LEN_32 
  *         @arg @ref LL_DMA_DST_BURST_LEN_64 
  *         @arg @ref LL_DMA_DST_BURST_LEN_128
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstBurstLen(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
             DMA_CH_CTRLL_DST_MSIZE));
}

/**
  * @brief  Set source increment mode.
  * @rmtoll CH_CTRLL         CTRLL_SINC            LL_DMA_SetSrcIncMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  IncMode This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_ADDR_INC
  *         @arg @ref LL_DMA_SRC_ADDR_DEC
  *         @arg @ref LL_DMA_SRC_ADDR_FIX
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcIncMode(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t IncMode)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_SINC,
             IncMode);
}

/**
  * @brief  Get source increment mode.
  * @rmtoll CH_CTRLL         CTRLL_SINC            LL_DMA_GetSrcIncMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_ADDR_INC
  *         @arg @ref LL_DMA_SRC_ADDR_DEC
  *         @arg @ref LL_DMA_SRC_ADDR_FIX
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcIncMode(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
                   DMA_CH_CTRLL_SINC));
}

/**
  * @brief  Set destination increment mode.
  * @rmtoll CH_CTRLL         DINC            LL_DMA_SetDstIncMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  IncMode This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DST_ADDR_INC
  *         @arg @ref LL_DMA_DST_ADDR_DEC
  *         @arg @ref LL_DMA_DST_ADDR_FIX
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstIncMode(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t IncMode)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_DINC,
             IncMode);
}

/**
  * @brief  Get destination increment mode.
  * @rmtoll CH_CTRLL         DINC            LL_DMA_GetDstIncMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DST_ADDR_INC
  *         @arg @ref LL_DMA_DST_ADDR_DEC
  *         @arg @ref LL_DMA_DST_ADDR_FIX
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstIncMode(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
                   DMA_CH_CTRLL_DINC));
}

/**
  * @brief  Set Source transfer bit width.
  * @rmtoll CH_CTRLL         SRC_TR_WIDTH            LL_DMA_SetSrcWidth
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Width This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_WIDTH_BYTE    
  *         @arg @ref LL_DMA_SRC_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_SRC_WIDTH_WORD    
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcWidth(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Width)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_SRC_TR_WIDTH,
             Width);
}

/**
  * @brief  Get Source transfer bit width.
  * @rmtoll CH_CTRLL         SRC_TR_WIDTH            LL_DMA_GetSrcWidth
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_WIDTH_BYTE    
  *         @arg @ref LL_DMA_SRC_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_SRC_WIDTH_WORD  
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcWidth(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
                   DMA_CH_CTRLL_SRC_TR_WIDTH));
}

/**
  * @brief  Set destination transfer bit width.
  * @rmtoll CH_CTRLL         DST_TR_WIDTH            LL_DMA_SetDstWidth
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Width This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DST_WIDTH_BYTE    
  *         @arg @ref LL_DMA_DST_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_DST_WIDTH_WORD    
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstWidth(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Width)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_DST_TR_WIDTH,
             Width);
}

