Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/**
  * @brief  Get destination transfer bit width.
  * @rmtoll CH_CTRLL         DST_TR_WIDTH            LL_DMA_GetDstWidth
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DST_WIDTH_BYTE    
  *         @arg @ref LL_DMA_DST_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_DST_WIDTH_WORD    
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstWidth(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
                   DMA_CH_CTRLL_DST_TR_WIDTH));
}

/**
  * @brief  Set the Block length.
  * @rmtoll CH_CTRLH         CH_CTRLH            LL_DMA_SetBlockLength
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  BlockLength Between Min_Data = 0 and Max_Data = 0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetBlockLength(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t BlockLength)
{
  WRITE_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLH, BlockLength);
}

/**
  * @brief  Get the Block length.
  * @rmtoll CH_CTRLH         CH_CTRLH            LL_DMA_GetBlockLength
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Between Min_Data = 0 and Max_Data = 0xFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetBlockLength(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLH));
}


/**
  * @brief  Enable destination Reload.
  * @rmtoll CH_CFGL         RELOAD_DST            LL_DMA_EnableDstReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableDstReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_RELOAD_DST);
}

/**
  * @brief  Disable destination Reload.
  * @rmtoll CH_CFGL         RELOAD_DST            LL_DMA_DisableDstReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  */
__STATIC_INLINE void LL_DMA_DisableDstReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  CLEAR_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_RELOAD_DST);
}

/**
  * @brief  Check if destination reload is enabled.
  * @rmtoll CH_CFGL          RELOAD_DST          LL_DMA_IsEnabledDstReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledDstReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
             DMA_CH_CFGL_RELOAD_DST) == DMA_CH_CFGL_RELOAD_DST );
}

/**
  * @brief  Enable source Reload.
  * @rmtoll CH_CFGL         RELOAD_SRC            LL_DMA_EnableSrcReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableSrcReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_RELOAD_SRC);
}

/**
  * @brief  Disable source Reload.
  * @rmtoll CH_CFGL         RELOAD_SRC            LL_DMA_DisableSrcReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  */
__STATIC_INLINE void LL_DMA_DisableSrcReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  CLEAR_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_RELOAD_SRC);
}

/**
  * @brief  Check if source reload is enabled.
  * @rmtoll CH_CFGL          RELOAD_SRC          LL_DMA_IsEnabledSrcReload
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledSrcReload(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
             DMA_CH_CFGL_RELOAD_SRC) == DMA_CH_CFGL_RELOAD_SRC );
}

/**
  * @brief  Set Max AMBA Burst Length.
  * @rmtoll CH_CFGL         MAX_ABRST            LL_DMA_SetMaxAMBABurstLength
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Length Between Min_Data = 0 and Max_Data = 0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetMaxAMBABurstLength(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Length)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,DMA_CH_CFGL_MAX_ABRST, Length<<DMA_CH_CFGL_MAX_ABRST_Pos);
}

/**
  * @brief  Get Max AMBA Burst Length.
  * @rmtoll CH_CFGL         MAX_ABRST            LL_DMA_GetMaxAMBABurstLength
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Between Min_Data = 0 and Max_Data = 0xFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetMaxAMBABurstLength(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,DMA_CH_CFGL_MAX_ABRST);
}

/**
  * @brief  Set source Handshake Type.
  * @rmtoll CH_CFGL         HS_SEL_SRC            LL_DMA_SetSrcHandshakeType
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_HANDSHAKE_TYPE_HARD   
  *         @arg @ref LL_DMA_SRC_HANDSHAKE_TYPE_SOFT
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcHandshakeType(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Type)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_HS_SEL_SRC,
             Type);
}

/**
  * @brief  Get source Handshake Type.
  * @rmtoll CH_CFGL         HS_SEL_SRC            LL_DMA_GetSrcHandshakeType
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_HANDSHAKE_TYPE_HARD   
  *         @arg @ref LL_DMA_SRC_HANDSHAKE_TYPE_SOFT 
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcHandshakeType(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
                   DMA_CH_CFGL_HS_SEL_SRC);
}


/**
  * @brief  Set dest Handshake Type.
  * @rmtoll CH_CFGL         HS_SEL_DST            LL_DMA_SetDstHandshakeType
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DST_HANDSHAKE_TYPE_HARD   
  *         @arg @ref LL_DMA_DST_HANDSHAKE_TYPE_SOFT
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstHandshakeType(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Type)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_HS_SEL_DST,
             Type);
}

/**
  * @brief  Get dest Handshake Type.
  * @rmtoll CH_CFGL         HS_SEL_DST            LL_DMA_GetDstHandshakeType
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DST_HANDSHAKE_TYPE_HARD   
  *         @arg @ref LL_DMA_DST_HANDSHAKE_TYPE_SOFT
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstHandshakeType(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
                   DMA_CH_CFGL_HS_SEL_DST));
}

/**
  * @brief  Enable Channel Suspend.
  * @rmtoll CH_CFGL         CH_SUSP            LL_DMA_EnableChannelSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableChannelSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
}

/**
  * @brief  Disable Channel Suspend.
  * @rmtoll CH_CFGL         CH_SUSP            LL_DMA_DisableChannelSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  */
__STATIC_INLINE void LL_DMA_DisableChannelSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  CLEAR_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
}


/**
  * @brief  Check if Channel Suspend is enabled.
  * @rmtoll CH_CFGL          CH_SUSP          LL_DMA_IsEnabledChannelSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledChannelSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
             DMA_CH_CFGL_CH_SUSP) == DMA_CH_CFGL_CH_SUSP );
}

/**
  * @brief  Set Channel priority level.
  * @rmtoll CH_CFGL          CH_PRIOR            LL_DMA_SetChannelPriorityLevel
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Priority This parameter can be one of the following values:
  *         @arg @ref LL_DMA_PRIORITY_0
  *         @arg @ref LL_DMA_PRIORITY_1
  *         @arg @ref LL_DMA_PRIORITY_2
  *         @arg @ref LL_DMA_PRIORITY_3
  *         @arg @ref LL_DMA_PRIORITY_4
  *         @arg @ref LL_DMA_PRIORITY_5
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetChannelPriorityLevel(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Priority)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_CH_PRIOR,
             Priority);
}

/**
  * @brief  Get Channel priority level.
  * @rmtoll CH_CFGL          CH_PRIOR            LL_DMA_GetChannelPriorityLevel
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_PRIORITY_0
  *         @arg @ref LL_DMA_PRIORITY_1
  *         @arg @ref LL_DMA_PRIORITY_2
  *         @arg @ref LL_DMA_PRIORITY_3
  *         @arg @ref LL_DMA_PRIORITY_4
  *         @arg @ref LL_DMA_PRIORITY_5
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelPriorityLevel(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
                   DMA_CH_CFGL_CH_PRIOR));
}

/**
  * @brief  Enable Interrupt Suspend.
  * @rmtoll CH_CFGL         INT_SUSP            LL_DMA_EnableInterruptSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  */
__STATIC_INLINE void LL_DMA_EnableInterruptSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_INT_SUSP);
}

/**
  * @brief  Disable Interrupt Suspend.
  * @rmtoll CH_CFGL         INT_SUSP            LL_DMA_DisableInterruptSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  */
__STATIC_INLINE void LL_DMA_DisableInterruptSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  CLEAR_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL, DMA_CH_CFGL_INT_SUSP);
}

/**
  * @brief  Check if Interrupt Suspend is enabled.
  * @rmtoll CH_CFGL          INT_SUSP          LL_DMA_IsEnabledInterruptSuspend
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledInterruptSuspend(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGL,
             DMA_CH_CFGL_INT_SUSP) == DMA_CH_CFGL_INT_SUSP );
}

/**
  * @brief  Set FIFO Mode .
  * @rmtoll CH_CFGH         FIFO_MODE            LL_DMA_SetFIFOMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_DMA_FIFO_MODE_0   
  *         @arg @ref LL_DMA_FIFO_MODE_1
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetFIFOMode(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Mode)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH, DMA_CH_CFGH_FIFO_MODE,
             Mode);
}

/**
  * @brief  Get FIFO Mode.
  * @rmtoll CH_CFGH         FIFO_MODE            LL_DMA_GetFIFOMode
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_FIFO_MODE_0   
  *         @arg @ref LL_DMA_FIFO_MODE_1  
  */
__STATIC_INLINE uint32_t LL_DMA_GetFIFOMode(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH,
                   DMA_CH_CFGH_FIFO_MODE));
}

/**
  * @brief  Set DST Periph Map.
  * @rmtoll CH_CFGH         DST_PER            LL_DMA_SetDstPeriphMap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  PeriphMap This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_1   
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_2  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_3  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_4  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_5 
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_6 
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstPeriphMap(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t PeriphMap)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH, DMA_CH_CFGH_DST_PER,
             PeriphMap);
}

/**
  * @brief  Get DST Periph Map.
  * @rmtoll CH_CFGH         DST_PER            LL_DMA_GetDstPeriphMap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_1   
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_2  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_3  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_4  
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_5 
  *         @arg @ref LL_DMA_DST_PERIPH_MAP_6 
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstPeriphMap(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH,
                   DMA_CH_CFGH_DST_PER));
}


/**
  * @brief  Set SRC Periph Map.
  * @rmtoll CH_CFGH         SRC_PER            LL_DMA_SetSrcPeriphMap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  PeriphMap This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_1   
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_2  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_3  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_4  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_5 
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_6 
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcPeriphMap(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t PeriphMap)
{
  MODIFY_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH, DMA_CH_CFGH_SRC_PER,
             PeriphMap);
}

