Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/**
  * @brief  Get SRC Periph Map.
  * @rmtoll CH_CFGH         SRC_PER            LL_DMA_GetSrcPeriphMap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_1   
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_2  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_3  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_4  
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_5 
  *         @arg @ref LL_DMA_SRC_PERIPH_MAP_6 
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcPeriphMap(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CFGH,
                   DMA_CH_CFGH_SRC_PER));
}

/**
  * @brief  Configure the Source and Destination addresses.
  * @note   This API must not be called when the DMA channel is enabled.
  * @note   Each IP using DMA provides an API to get directly the register adress (LL_PPP_DMA_GetRegAddr).
  * @rmtoll SA         SA            LL_DMA_ConfigAddresses\n
  *         DA         DA            LL_DMA_ConfigAddresses
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  SrcAddress Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  * @param  DstAddress Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ConfigAddresses(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t SrcAddress,
                                            uint32_t DstAddress)
{
  WRITE_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->SA, SrcAddress);
  WRITE_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->DA, DstAddress);
}

/**
  * @brief  Set the Src address.
  * @rmtoll SA         SA            LL_DMA_SetSRCAddress
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  SrcAddress Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetSrcAddress(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t SrcAddress)
{
  WRITE_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->SA, SrcAddress);
}

/**
  * @brief  Set the Dst address.
  * @rmtoll DA         DA            LL_DMA_SetDSTAddress
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @param  DstAddress Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void LL_DMA_SetDstAddress(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t DstAddress)
{
  WRITE_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->DA, DstAddress);
}

/**
  * @brief  Get Src address.
  * @rmtoll SA         SA            LL_DMA_GetSrcAddress
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcAddress(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->SA));
}

/**
  * @brief  Get Dst address.
  * @rmtoll DA         DA            LL_DMA_GetDstAddress
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval Between Min_Data = 0 and Max_Data = 0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetDstAddress(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_REG(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->DA));
}

/**
  * @brief  Enable Src Request.
  * @rmtoll REQSRC          SRC_REQ          LL_DMA_EnableSrcRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableSrcRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->REQSRC, (DMA_REQSRC_SRC_REQ_0 | DMA_REQSRC_SRC_REQ_WE_0) << (Channel-1) );
}

/**
  * @brief  Disable Src Request.
  * @rmtoll REQSRC          SRC_REQ          LL_DMA_DisableSrcRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableSrcRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->REQSRC,(DMA_REQSRC_SRC_REQ_0 | DMA_REQSRC_SRC_REQ_WE_0)<<(Channel-1),DMA_REQSRC_SRC_REQ_WE_0<<(Channel-1));
}

/**
  * @brief  Check if Src Request is enabled.
  * @rmtoll REQSRC          SRC_REQ          LL_DMA_IsEnabledSrcRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledSrcRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->REQSRC, DMA_REQSRC_SRC_REQ_0<<(Channel-1)) == (DMA_REQSRC_SRC_REQ_0<<(Channel-1)));
}

/**
  * @brief  Enable Dst Request.
  * @rmtoll REQDST          DST_REQ          LL_DMA_EnableDstRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableDstRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->REQDST, (DMA_REQDST_DST_REQ_0 | DMA_REQDST_DST_REQ_WE_0) << (Channel-1));
}

/**
  * @brief  Disable Dst request.
  * @rmtoll REQDST          DST_REQ          LL_DMA_DisableDstRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableDstRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->REQDST,(DMA_REQDST_DST_REQ_0 | DMA_REQDST_DST_REQ_WE_0)<<(Channel-1),DMA_REQDST_DST_REQ_WE_0<<(Channel-1));
}

/**
  * @brief  Check if Dest Request is enabled.
  * @rmtoll REQDST          DST_REQ          LL_DMA_IsEnabledDstRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledDstRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->REQDST, DMA_REQDST_DST_REQ_0<<(Channel-1)) == (DMA_REQDST_DST_REQ_0<<(Channel-1)));
}

/**
  * @brief  Enable Src Single Request.
  * @rmtoll SGLRQSRC          SRC_SGLREQ          LL_DMA_EnableSrcSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableSrcSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->SGLRQSRC, (DMA_SGLRQSRC_SRC_SGLREQ_0 | DMA_SGLRQSRC_SRC_SGLREQ_WE_0) << (Channel-1) );
}

/**
  * @brief  Disable Src Single Request.
  * @rmtoll SGLRQSRC          SRC_SGLREQ          LL_DMA_DisableSrcSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableSrcSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->SGLRQSRC,(DMA_SGLRQSRC_SRC_SGLREQ_0 | DMA_SGLRQSRC_SRC_SGLREQ_WE_0)<<(Channel-1),DMA_SGLRQSRC_SRC_SGLREQ_WE_0<<(Channel-1));
}

/**
  * @brief  Check if Src Single Request is enabled.
  * @rmtoll SGLRQSRC          SRC_SGLREQ          LL_DMA_IsEnabledSrcSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledSrcSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->SGLRQSRC, DMA_SGLRQSRC_SRC_SGLREQ_0<<(Channel-1)) == (DMA_SGLRQSRC_SRC_SGLREQ_0<<(Channel-1)));
}

/**
  * @brief  Enable Dst Single Request.
  * @rmtoll SGLRQDST          DST_SGLREQ          LL_DMA_EnableDstSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableDstSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->SGLRQDST, (DMA_SGLRQDST_DST_SGLREQ_0 | DMA_SGLRQDST_DST_SGLREQ_WE_0) << (Channel-1) );
}

/**
  * @brief  Disable Dst Single Request.
  * @rmtoll SGLRQDST          DST_SGLREQ          LL_DMA_DisableDstSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableDstSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->SGLRQDST,(DMA_SGLRQDST_DST_SGLREQ_0 | DMA_SGLRQDST_DST_SGLREQ_WE_0)<<(Channel-1),DMA_SGLRQDST_DST_SGLREQ_WE_0<<(Channel-1));
}

/**
  * @brief  Check if Dst TSingle Request is enabled.
  * @rmtoll SGLRQDST          DST_SGLREQ          LL_DMA_IsEnabledDstSingleRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledDstSingleRequest(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->SGLRQDST, DMA_SGLRQDST_DST_SGLREQ_0<<(Channel-1)) == (DMA_SGLRQDST_DST_SGLREQ_0<<(Channel-1)));
}

/**
  * @}
  */

