Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/** @defgroup DMA_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Get Channel 1 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_0) == DMA_STATUSTFR_STATUS_0);
}

/**
  * @brief  Get Channel 2 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_1) == DMA_STATUSTFR_STATUS_1);
}

/**
  * @brief  Get Channel 3 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_2) == DMA_STATUSTFR_STATUS_2);
}

/**
  * @brief  Get Channel 4 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_3) == DMA_STATUSTFR_STATUS_3);
}

/**
  * @brief  Get Channel 5 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_4) == DMA_STATUSTFR_STATUS_4);
}

/**
  * @brief  Get Channel 6 transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSTFR, DMA_STATUSTFR_STATUS_5) == DMA_STATUSTFR_STATUS_5);
}

/**
  * @brief  Get one of channls transfer complete flag.
  * @rmtoll STATUSTFR          STATUS         LL_DMA_IsActiveFlag_TFR6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_TFR(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_TFR) == DMA_STATUSINT_TFR);
}

/**
  * @brief  Get Channel 1 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_0) == DMA_STATUSBLOCK_STATUS_0);
}

/**
  * @brief  Get Channel 2 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_1) == DMA_STATUSBLOCK_STATUS_1);
}

/**
  * @brief  Get Channel 3 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_2) == DMA_STATUSBLOCK_STATUS_2);
}

/**
  * @brief  Get Channel 4 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_3) == DMA_STATUSBLOCK_STATUS_3);
}

/**
  * @brief  Get Channel 5 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_4) == DMA_STATUSBLOCK_STATUS_4);
}

/**
  * @brief  Get Channel 6 block transfer complete flag.
  * @rmtoll STATUSBLOCK          STATUS         LL_DMA_IsActiveFlag_BLOCK6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSBLOCK, DMA_STATUSBLOCK_STATUS_5) == DMA_STATUSBLOCK_STATUS_5);
}

/**
  * @brief  Get one of channls block complete flag.
  * @rmtoll STATUSINT          BLOCK         LL_DMA_IsActiveFlag_BLOCK
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_BLOCK(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_BLOCK) == DMA_STATUSINT_BLOCK);
}

/**
  * @brief  Get Channel 1 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_0) == DMA_STATUSBLOCK_STATUS_0);
}

/**
  * @brief  Get Channel 2 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_1) == DMA_STATUSBLOCK_STATUS_1);
}

/**
  * @brief  Get Channel 3 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_2) == DMA_STATUSBLOCK_STATUS_2);
}

/**
  * @brief  Get Channel 4 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_3) == DMA_STATUSBLOCK_STATUS_3);
}

/**
  * @brief  Get Channel 5 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_4) == DMA_STATUSBLOCK_STATUS_4);
}

/**
  * @brief  Get Channel 6 block half transfer flag.
  * @rmtoll STATUSHALFBLOCK          STATUS         LL_DMA_IsActiveFlag_HALFBLOCK6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSHALFBLOCK, DMA_STATUSHALFBLOCK_STATUS_5) == DMA_STATUSBLOCK_STATUS_5);
}

/**
  * @brief  Get one of channls half block transfer complete flag.
  * @rmtoll STATUSINT          HALFBLOCK         LL_DMA_IsActiveFlag_HALFBLOCK
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_HALFBLOCK(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_HALFBLOCK) == DMA_STATUSINT_HALFBLOCK);
}

/**
  * @brief  Get Channel 1 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_0) == DMA_STATUSSRCTRAN_STATUS_0);
}

/**
  * @brief  Get Channel 2 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_1) == DMA_STATUSSRCTRAN_STATUS_1);
}

/**
  * @brief  Get Channel 3 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_2) == DMA_STATUSSRCTRAN_STATUS_2);
}

/**
  * @brief  Get Channel 4 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_3) == DMA_STATUSSRCTRAN_STATUS_3);
}

/**
  * @brief  Get Channel 5 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_4) == DMA_STATUSSRCTRAN_STATUS_4);
}

/**
  * @brief  Get Channel 6 source transfer flag.
  * @rmtoll STATUSSRCTRAN          STATUS         LL_DMA_IsActiveFlag_SRCTRAN6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSSRCTRAN, DMA_STATUSSRCTRAN_STATUS_5) == DMA_STATUSSRCTRAN_STATUS_5);
}

/**
  * @brief  Get one of channls srctran complete flag.
  * @rmtoll STATUSINT          SRCT         LL_DMA_IsActiveFlag_SRCTRAN
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_SRCTRAN(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_SRCT) == DMA_STATUSINT_SRCT);
}

/**
  * @brief  Get Channel 1 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_0) == DMA_STATUSDSTTRAN_STATUS_0);
}

/**
  * @brief  Get Channel 2 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_1) == DMA_STATUSDSTTRAN_STATUS_1);
}

/**
  * @brief  Get Channel 3 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_2) == DMA_STATUSDSTTRAN_STATUS_2);
}

/**
  * @brief  Get Channel 4 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_3) == DMA_STATUSDSTTRAN_STATUS_3);
}

/**
  * @brief  Get Channel 5 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_4) == DMA_STATUSDSTTRAN_STATUS_4);
}

/**
  * @brief  Get Channel 6 dest transfer flag.
  * @rmtoll STATUSDSTTRAN          STATUS         LL_DMA_IsActiveFlag_DSTTRAN6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSDSTTRAN, DMA_STATUSDSTTRAN_STATUS_5) == DMA_STATUSDSTTRAN_STATUS_5);
}

/**
  * @brief  Get one of channls dsttran complete flag.
  * @rmtoll STATUSINT          DSTT         LL_DMA_IsActiveFlag_DSTTRAN
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_DSTTRAN(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_DSTT) == DMA_STATUSINT_DSTT);
}

/**
  * @brief  Get Channel 1 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR1
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR1(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_0) == DMA_STATUSERR_STATUS_0);
}

/**
  * @brief  Get Channel 2 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR2
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR2(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_1) == DMA_STATUSERR_STATUS_1);
}

/**
  * @brief  Get Channel 3 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR3
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR3(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_2) == DMA_STATUSERR_STATUS_2);
}

/**
  * @brief  Get Channel 4 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR4
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR4(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_3) == DMA_STATUSERR_STATUS_3);
}

/**
  * @brief  Get Channel 5 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR5
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR5(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_4) == DMA_STATUSERR_STATUS_4);
}

/**
  * @brief  Get Channel 6 transfer error flag.
  * @rmtoll STATUSERR          STATUS         LL_DMA_IsActiveFlag_ERR6
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSERR, DMA_STATUSERR_STATUS_5) == DMA_STATUSERR_STATUS_5);
}

/**
  * @brief  Get one of channls error flag.
  * @rmtoll STATUSINT          ERR         LL_DMA_IsActiveFlag_ERR
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ERR(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->STATUSINT, DMA_STATUSINT_ERR) == DMA_STATUSINT_ERR);
}

/**
  * @brief  Clear Channel 1 transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_0);
}

/**
  * @brief  Clear Channel 2  transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_1);
}

/**
  * @brief  Clear Channel 3  transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_2);
}

/**
  * @brief  Clear Channel 4  transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_3);
}

/**
  * @brief  Clear Channel 5  transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_4);
}

/**
  * @brief  Clear Channel 6  transfer complete flag.
  * @rmtoll CLEARTFR         CLEAR        LL_DMA_ClearFlag_TFR6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_TFR6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARTFR,DMA_CLEARTFR_CLEAR_5);
}


/**
  * @brief  Clear Channel 1 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_0);
}

/**
  * @brief  Clear Channel 2 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_1);
}

/**
  * @brief  Clear Channel 3 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_2);
}

/**
  * @brief  Clear Channel 4 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_3);
}

/**
  * @brief  Clear Channel 5 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_4);
}

/**
  * @brief  Clear Channel 6 block transfer complete flag.
  * @rmtoll CLEARBLOCK         CLEAR        LL_DMA_ClearFlag_BLOCK6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_BLOCK6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARBLOCK,DMA_CLEARBLOCK_CLEAR_5);
}


/**
  * @brief  Clear Channel 1 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_0);
}

/**
  * @brief  Clear Channel 2 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_1);
}

/**
  * @brief  Clear Channel 3 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_2);
}

/**
  * @brief  Clear Channel 4 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_3);
}

/**
  * @brief  Clear Channel 5 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_4);
}

/**
  * @brief  Clear Channel 6 block half transfer flag.
  * @rmtoll CLEARHALFBLOCK         CLEAR        LL_DMA_ClearFlag_HALFBLOCK6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_HALFBLOCK6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARHALFBLOCK,DMA_CLEARHALFBLOCK_CLEAR_5);
}

/**
  * @brief  Clear Channel 1 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_0);
}

/**
  * @brief  Clear Channel 2 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_1);
}

/**
  * @brief  Clear Channel 3 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_2);
}

/**
  * @brief  Clear Channel 4 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_3);
}

/**
  * @brief  Clear Channel 5 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_4);
}

/**
  * @brief  Clear Channel 6 transfer error flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_ERR6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ERR6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARERR,DMA_CLEARERR_CLEAR_5);
}

/**
  * @brief  Clear Channel 1 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_0);
}

/**
  * @brief  Clear Channel 2 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_1);
}

/**
  * @brief  Clear Channel 3 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_2);
}

