Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
/**
  * @brief  Clear Channel 4 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_3);
}

/**
  * @brief  Clear Channel 5 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_4);
}

/**
  * @brief  Clear Channel 6 source transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_SRCTRAN6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_SRCTRAN6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARSRCTRAN,DMA_CLEARERR_CLEAR_5);
}
/**
  * @brief  Clear Channel 1 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN1
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN1(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_0);
}

/**
  * @brief  Clear Channel 2 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN2
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN2(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_1);
}

/**
  * @brief  Clear Channel 3 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN3
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN3(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_2);
}

/**
  * @brief  Clear Channel 4 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN4
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN4(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_3);
}

/**
  * @brief  Clear Channel 5 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN5
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN5(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_4);
}

/**
  * @brief  Clear Channel 6 dest transfer completely flag.
  * @rmtoll CLEARERR         CLEAR        LL_DMA_ClearFlag_DSTTRAN6
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_DSTTRAN6(DMA_TypeDef *DMAx)
{
  SET_BIT(DMAx->CLEARDSTTRAN,DMA_CLEARERR_CLEAR_5);
}
/**
  * @}
  */

/** @defgroup DMA_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable DMA interrupt.
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_INT_EN);
}

/**
  * @brief  Disable DMA interrupt.
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT(DMA_TypeDef *DMAx, uint32_t Channel)
{
  CLEAR_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL, DMA_CH_CTRLL_INT_EN);
}

/**
  * @brief  Check if DMA Interrupt is enabled.
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(((DMA_Channel_TypeDef *)((uint32_t)((uint32_t)DMAx + CHANNEL_OFFSET_TAB[Channel - 1U])))->CH_CTRLL,
                   DMA_CH_CTRLL_INT_EN) == (DMA_CH_CTRLL_INT_EN));
}

/**
  * @brief  Enable Transfer complete interrupt.
  * @rmtoll MASKTFR          INT_MASK          LL_DMA_EnableIT_TFR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6

  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_TFR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKTFR, (DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Enable block transfer complete interrupt.
  * @rmtoll MASKBLOCK          INT_MASK          LL_DMA_EnableIT_BLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_BLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKBLOCK, (DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Enable Half transfer interrupt.
  * @rmtoll MASKHALFBLOCK          INT_MASK          LL_DMA_EnableIT_HALFBLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_HALFBLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKHALFBLOCK, (DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Enable Transfer error interrupt.
  * @rmtoll MASKERR          INT_MASK          LL_DMA_EnableIT_ERR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_ERR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKERR, (DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Enable Src Transfer interrupt.
  * @rmtoll MASKSRCTRAN          INT_MASK          LL_DMA_EnableIT_SRCTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_SRCTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKSRCTRAN, (DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Enable Dst Transfer interrupt.
  * @rmtoll MASKDSTTRAN          INT_MASK          LL_DMA_EnableIT_DSTTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_EnableIT_DSTTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  SET_BIT(DMAx->MASKDSTTRAN, (DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << (Channel-1) );
}

/**
  * @brief  Disable Transfer complete interrupt.
  * @rmtoll MASKTFR          INT_MASK          LL_DMA_DisableIT_TFR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_TFR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKTFR,(DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0)<<(Channel-1),DMA_MASKTFR_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Disable Block Transfer complete interrupt.
  * @rmtoll MASKBLOCK          INT_MASK          LL_DMA_DisableIT_BLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_BLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKBLOCK,(DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0)<<(Channel-1),DMA_MASKBLOCK_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Disable Block Half transfer interrupt.
  * @rmtoll MASKHALFBLOCK          INT_MASK          LL_DMA_DisableIT_HALFBLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_HALFBLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKHALFBLOCK,(DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0)<<(Channel-1),DMA_MASKHALFBLOCK_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Disable Transfer error interrupt.
  * @rmtoll MASKERR          INT_MASK          LL_DMA_DisableIT_ERR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_ERR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKERR,(DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0)<<(Channel-1),DMA_MASKERR_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Disable Src Transfer interrupt.
  * @rmtoll MASKSRCTRAN          INT_MASK          LL_DMA_DisableIT_SRCTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_SRCTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKSRCTRAN,(DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0)<<(Channel-1),DMA_MASKSRCTRAN_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Disable Transfer error interrupt.
  * @rmtoll MASKDSTTRAN          INT_MASK          LL_DMA_DisableIT_DSTTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval None
  */
__STATIC_INLINE void LL_DMA_DisableIT_DSTTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  MODIFY_REG(DMAx->MASKDSTTRAN,(DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0)<<(Channel-1),DMA_MASKDSTTRAN_INT_MASK_WE_0<<(Channel-1));
}

/**
  * @brief  Check if Transfer complete Interrupt is enabled.
  * @rmtoll MASKTFR          INT_MASK          LL_DMA_IsEnabledIT_TFR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_TFR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKTFR, DMA_MASKTFR_INT_MASK_0<<(Channel-1)) == (DMA_MASKTFR_INT_MASK_0<<(Channel-1)));
}

/**
  * @brief  Check if block Transfer complete Interrupt is enabled.
  * @rmtoll MASKBLOCK          INT_MASK          LL_DMA_IsEnabledIT_BLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_BLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKBLOCK, DMA_MASKBLOCK_INT_MASK_0<<(Channel-1)) == (DMA_MASKBLOCK_INT_MASK_0<<(Channel-1)));
}

/**
  * @brief  Check if Block Half transfer Interrupt is enabled.
  * @rmtoll MASKHALFBLOCK          INT_MASK          LL_DMA_IsEnabledIT_HALFBLOCK
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_HALFBLOCK(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKHALFBLOCK, DMA_MASKHALFBLOCK_INT_MASK_0<<(Channel-1)) == (DMA_MASKHALFBLOCK_INT_MASK_0<<(Channel-1)));
}

/**
  * @brief  Check if Transfer error Interrupt is enabled.
  * @rmtoll MASKERR          INT_MASK          LL_DMA_IsEnabledIT_ERR
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_ERR(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKERR, DMA_MASKERR_INT_MASK_0<<(Channel-1)) == (DMA_MASKERR_INT_MASK_0<<(Channel-1)));
}

/**
  * @brief  Check if Src Transfer Interrupt is enabled.
  * @rmtoll MASKSRCTRAN          INT_MASK          LL_DMA_IsEnabledIT_SRCTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_SRCTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKSRCTRAN, DMA_MASKSRCTRAN_INT_MASK_0<<(Channel-1)) == (DMA_MASKSRCTRAN_INT_MASK_0<<(Channel-1)));
}

/**
  * @brief  Check if Dest Transfer Interrupt is enabled.
  * @rmtoll MASKDSTTRAN          INT_MASK          LL_DMA_IsEnabledIT_DSTTRAN
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_DSTTRAN(DMA_TypeDef *DMAx, uint32_t Channel)
{
  return (READ_BIT(DMAx->MASKDSTTRAN, DMA_MASKDSTTRAN_INT_MASK_0<<(Channel-1)) == (DMA_MASKDSTTRAN_INT_MASK_0<<(Channel-1)));
}
/**
  * @}
  */

/** @defgroup DMA_REMAP DMA Remap
  * @{
  */

/**
  * @brief  Set the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  DMAPeriphMap This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_1
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_2
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_3
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_4
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_5
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_6
  * @param  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1           
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC2          
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC3          
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1           
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2           
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_RX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_RX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_TX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C3_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C3_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C4_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C4_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRIG    
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH2     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH3      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_COM      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRIG      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH4     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH4       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_TRIG      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH2      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH3    
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_COM     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_AES_IN         
  *         @arg @ref LL_SYSCFG_DMA_MAP_AES_OUT        
  *         @arg @ref LL_SYSCFG_DMA_MAP_Cordic_Read    
  *         @arg @ref LL_SYSCFG_DMA_MAP_Cordic_Write   
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_SDIO           
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART2_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART2_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART3_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART3_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_LCDC_TX        
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetDMARemap(DMA_TypeDef *DMAx, uint32_t DMAPeriphMap, uint32_t MapReqNum)
{
  uint32_t position = 0;

