Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_dma.h
  /* Configure the requested functionality */
  if (DMAx == DMA1)
  {
    position = DMAPeriphMap - 1;
  }
  else 
  {
    position = DMAPeriphMap -1 + 6;
  }

  MODIFY_REG((SYSCFG->CFGR[2 + (position >> 2)]), (0x7F << (8u * (position & 0x03u))), (MapReqNum << (8u * (position & 0x03u))));
}

/**
  * @brief  Get the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  DMAPeriphMap This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_1
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_2
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_3
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_4
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_5
  *         @arg @ref LL_SYSCFG_DMA_PERIPH_MAP_6
  * @return  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1          
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC2           
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC3         
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1        
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2          
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI3_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RX    
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_TX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_TX    
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_RX     
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_TX    
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_TX        
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C3_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C3_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C4_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C4_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRIG    
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_CH4       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM8_COM     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4    
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP        
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRIG      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH3       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_CH4       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_UP     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM4_TRIG      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH1       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH2       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH3      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_CH4       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM5_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH2     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH3      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_CH4      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM18_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_TRIG     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_COM     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_CH1      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_UP      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_CH1     
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_UP       
  *         @arg @ref LL_SYSCFG_DMA_MAP_AES_IN         
  *         @arg @ref LL_SYSCFG_DMA_MAP_AES_OUT       
  *         @arg @ref LL_SYSCFG_DMA_MAP_Cordic_Read   
  *         @arg @ref LL_SYSCFG_DMA_MAP_Cordic_Write   
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_ESMC_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_SDIO          
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART2_RX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART2_TX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART3_RX       
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART3_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_LCDC_TX       
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDMARemap(DMA_TypeDef *DMAx,uint32_t DMAPeriphMap)
{
  uint32_t position;

  /* Configure the requested functionality */
  if (DMAx == DMA1)
  {
    position = DMAPeriphMap - 1;
  }
  else 
  {
    position = DMAPeriphMap -1 + 6;
  }

  return (READ_BIT((SYSCFG->CFGR[2 + (position >> 2)]), (0x7F << (8u * (position & 0x03u)))) >>(8u * (position & 0x03u)));
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup DMA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

uint32_t LL_DMA_Init(DMA_TypeDef *DMAx, uint32_t Channel, LL_DMA_InitTypeDef *DMA_InitStruct);
uint32_t LL_DMA_DeInit(DMA_TypeDef *DMAx, uint32_t Channel);
void LL_DMA_StructInit(LL_DMA_InitTypeDef *DMA_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DMA1 || DMA2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_LL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
